Revit 2024 API
LightGroup Properties
The LightGroup type exposes the following members.
Properties
Name | Description
Id
 The ElementId of the LightGroup
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the LightGroup
See Also
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace